{
  "_name_or_path": "google/vit-base-patch16-224-in21k",
  "architectures": [
    "ViTForImageClassification"
  ],
  "attention_probs_dropout_prob": 0.0,
  "encoder_stride": 16,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.0,
  "hidden_size": 768,
  "id2label": {
    "0": "wire",
    "1": "saint_bernard",
    "2": "chow",
    "3": "dingo",
    "4": "malamute",
    "5": "shih",
    "6": "doberman",
    "7": "english_foxhound",
    "8": "bernese_mountain_dog",
    "9": "miniature_pinscher",
    "10": "irish_water_spaniel",
    "11": "bloodhound",
    "12": "chesapeake_bay_retriever",
    "13": "bouvier_des_flandres",
    "14": "labrador_retriever",
    "15": "standard_schnauzer",
    "16": "golden_retriever",
    "17": "papillon",
    "18": "kelpie",
    "19": "english_setter",
    "20": "border_collie",
    "21": "french_bulldog",
    "22": "giant_schnauzer",
    "23": "airedale",
    "24": "briard",
    "25": "japanese_spaniel",
    "26": "black",
    "27": "affenpinscher",
    "28": "staffordshire_bullterrier",
    "29": "pekinese",
    "30": "border_terrier",
    "31": "great_dane",
    "32": "afghan_hound",
    "33": "australian_terrier",
    "34": "basset",
    "35": "entlebucher",
    "36": "saluki",
    "37": "german_short",
    "38": "italian_greyhound",
    "39": "gordon_setter",
    "40": "cocker_spaniel",
    "41": "cardigan",
    "42": "old_english_sheepdog",
    "43": "pembroke",
    "44": "standard_poodle",
    "45": "weimaraner",
    "46": "blenheim_spaniel",
    "47": "beagle",
    "48": "flat",
    "49": "vizsla",
    "50": "west_highland_white_terrier",
    "51": "toy_poodle",
    "52": "sealyham_terrier",
    "53": "irish_wolfhound",
    "54": "walker_hound",
    "55": "silky_terrier",
    "56": "soft",
    "57": "great_pyrenees",
    "58": "siberian_husky",
    "59": "norfolk_terrier",
    "60": "irish_terrier",
    "61": "shetland_sheepdog",
    "62": "whippet",
    "63": "tibetan_mastiff",
    "64": "pug",
    "65": "rhodesian_ridgeback",
    "66": "miniature_schnauzer",
    "67": "keeshond",
    "68": "scottish_deerhound",
    "69": "lhasa",
    "70": "collie",
    "71": "rottweiler",
    "72": "brabancon_griffon",
    "73": "curly",
    "74": "basenji",
    "75": "borzoi",
    "76": "eskimo_dog",
    "77": "newfoundland",
    "78": "welsh_springer_spaniel",
    "79": "kerry_blue_terrier",
    "80": "kuvasz",
    "81": "lakeland_terrier",
    "82": "malinois",
    "83": "miniature_poodle",
    "84": "otterhound",
    "85": "leonberg",
    "86": "ibizan_hound",
    "87": "komondor",
    "88": "boston_bull",
    "89": "yorkshire_terrier",
    "90": "groenendael",
    "91": "appenzeller",
    "92": "clumber",
    "93": "greater_swiss_mountain_dog",
    "94": "scotch_terrier",
    "95": "tibetan_terrier",
    "96": "samoyed",
    "97": "schipperke",
    "98": "maltese_dog",
    "99": "dandie_dinmont",
    "100": "boxer",
    "101": "chihuahua",
    "102": "irish_setter",
    "103": "norwegian_elkhound",
    "104": "bull_mastiff",
    "105": "toy_terrier",
    "106": "norwich_terrier",
    "107": "german_shepherd",
    "108": "african_hunting_dog",
    "109": "bedlington_terrier",
    "110": "redbone",
    "111": "mexican_hairless",
    "112": "english_springer",
    "113": "sussex_spaniel",
    "114": "dhole",
    "115": "brittany_spaniel",
    "116": "american_staffordshire_terrier",
    "117": "bluetick",
    "118": "cairn",
    "119": "pomeranian"
  },
  "image_size": 224,
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "affenpinscher": 27,
    "afghan_hound": 32,
    "african_hunting_dog": 108,
    "airedale": 23,
    "american_staffordshire_terrier": 116,
    "appenzeller": 91,
    "australian_terrier": 33,
    "basenji": 74,
    "basset": 34,
    "beagle": 47,
    "bedlington_terrier": 109,
    "bernese_mountain_dog": 8,
    "black": 26,
    "blenheim_spaniel": 46,
    "bloodhound": 11,
    "bluetick": 117,
    "border_collie": 20,
    "border_terrier": 30,
    "borzoi": 75,
    "boston_bull": 88,
    "bouvier_des_flandres": 13,
    "boxer": 100,
    "brabancon_griffon": 72,
    "briard": 24,
    "brittany_spaniel": 115,
    "bull_mastiff": 104,
    "cairn": 118,
    "cardigan": 41,
    "chesapeake_bay_retriever": 12,
    "chihuahua": 101,
    "chow": 2,
    "clumber": 92,
    "cocker_spaniel": 40,
    "collie": 70,
    "curly": 73,
    "dandie_dinmont": 99,
    "dhole": 114,
    "dingo": 3,
    "doberman": 6,
    "english_foxhound": 7,
    "english_setter": 19,
    "english_springer": 112,
    "entlebucher": 35,
    "eskimo_dog": 76,
    "flat": 48,
    "french_bulldog": 21,
    "german_shepherd": 107,
    "german_short": 37,
    "giant_schnauzer": 22,
    "golden_retriever": 16,
    "gordon_setter": 39,
    "great_dane": 31,
    "great_pyrenees": 57,
    "greater_swiss_mountain_dog": 93,
    "groenendael": 90,
    "ibizan_hound": 86,
    "irish_setter": 102,
    "irish_terrier": 60,
    "irish_water_spaniel": 10,
    "irish_wolfhound": 53,
    "italian_greyhound": 38,
    "japanese_spaniel": 25,
    "keeshond": 67,
    "kelpie": 18,
    "kerry_blue_terrier": 79,
    "komondor": 87,
    "kuvasz": 80,
    "labrador_retriever": 14,
    "lakeland_terrier": 81,
    "leonberg": 85,
    "lhasa": 69,
    "malamute": 4,
    "malinois": 82,
    "maltese_dog": 98,
    "mexican_hairless": 111,
    "miniature_pinscher": 9,
    "miniature_poodle": 83,
    "miniature_schnauzer": 66,
    "newfoundland": 77,
    "norfolk_terrier": 59,
    "norwegian_elkhound": 103,
    "norwich_terrier": 106,
    "old_english_sheepdog": 42,
    "otterhound": 84,
    "papillon": 17,
    "pekinese": 29,
    "pembroke": 43,
    "pomeranian": 119,
    "pug": 64,
    "redbone": 110,
    "rhodesian_ridgeback": 65,
    "rottweiler": 71,
    "saint_bernard": 1,
    "saluki": 36,
    "samoyed": 96,
    "schipperke": 97,
    "scotch_terrier": 94,
    "scottish_deerhound": 68,
    "sealyham_terrier": 52,
    "shetland_sheepdog": 61,
    "shih": 5,
    "siberian_husky": 58,
    "silky_terrier": 55,
    "soft": 56,
    "staffordshire_bullterrier": 28,
    "standard_poodle": 44,
    "standard_schnauzer": 15,
    "sussex_spaniel": 113,
    "tibetan_mastiff": 63,
    "tibetan_terrier": 95,
    "toy_poodle": 51,
    "toy_terrier": 105,
    "vizsla": 49,
    "walker_hound": 54,
    "weimaraner": 45,
    "welsh_springer_spaniel": 78,
    "west_highland_white_terrier": 50,
    "whippet": 62,
    "wire": 0,
    "yorkshire_terrier": 89
  },
  "layer_norm_eps": 1e-12,
  "model_type": "vit",
  "num_attention_heads": 12,
  "num_channels": 3,
  "num_hidden_layers": 12,
  "patch_size": 16,
  "problem_type": "single_label_classification",
  "qkv_bias": true,
  "torch_dtype": "float32",
  "transformers_version": "4.28.1"
}
